{
  "postId": "10k-hours-tracker",
  "entries": [
    {
      "id": 1,
      "timestamp": "2026-02-04T00:00:00Z",
      "title": "Idea: Aplicación 10K Hours Tracker",
      "text": "Se me ocurrió crear una aplicación para trackear las horas que dedico a diferentes temas o habilidades. La inspiración viene de la Teoría de las 10,000 horas de Malcolm Gladwell, que propone que se necesitan aproximadamente 10,000 horas de práctica deliberada para alcanzar el nivel de experto en cualquier disciplina.\n\nConcepto de la interfaz: La visualización estaría inspirada en el contribution graph de GitHub (ese calendario con cuadros verdes que muestra la actividad de commits). Quiero que el usuario pueda ver su progreso de forma visual y clara, similar a cómo GitHub representa la actividad diaria.\n\nFuncionalidad principal: El usuario podrá registrar su progreso día a día. Por ejemplo: 'Hoy practiqué 3 horas de piano' se registra, y la app irá acumulando y visualizando todo el historial de práctica, mostrando el avance hacia la meta de las 10,000 horas.\n\nPróximos pasos: Tengo planeada una integración adicional con IA, pero eso lo detallaré en la siguiente nota."
    },
    {
      "id": 2,
      "timestamp": "2026-02-04T01:00:00Z",
      "title": "Stack Técnico y Primeros Pasos",
      "text": "Durante estas sesiones iré documentando todo el progreso del desarrollo. Será una app Android por el momento, ya que es más sencillo desplegarla.\n\nMetodología: El desarrollo será principalmente mediante vibe coding - yo genero las instrucciones y Claude Sonnet 4.5 se encarga de escribir todo el código, la base de datos, y los requerimientos técnicos/funcionales. El objetivo es no escribir absolutamente una sola línea de código manualmente.\n\nStack tecnológico: Runtime Bun (extremadamente rápido), Backend con Hono (framework web), Base de datos PostgreSQL, y ORM Prisma.\n\nEsquema de base de datos actual: Claude Code ya generó un esquema inicial bastante bueno con tres tablas principales: User (tabla de usuarios), Skills (los temas o habilidades que queremos trackear, ej: piano, programación), y Sessions (las horas registradas, relacionadas a cada skill).\n\nEstado actual: Estoy trabajando en los endpoints de registro de usuario. Ya tengo los requerimientos técnicos definidos y voy a crear pruebas automatizadas para validar el flujo de registro."
    },
    {
      "id": 3,
      "timestamp": "2026-02-04T02:00:00Z",
      "title": "Diseño UI, Flutter y Arquitectura Limpia",
      "text": "He estado revisando algunos temas y paletas de color para ver cómo pudiera hacer la aplicación. Estoy pensando seriamente en un verde, pero no lo sé, como con verdes un poco raro pero probablemente sí, dependiendo de cómo se vea. Por ahí voy a decirle a Claude que me genere un tema para Flutter.\n\nYo la neta no sé nada de Flutter, literal no sé nada de Flutter. Entonces ¿cómo le voy a hacer para saber si voy por el lugar correcto, que está escribiendo las instrucciones correctas? Pues por ahí utilicé instrucciones bien definidas que investigué, o que la misma gente también investigó y que sabe cómo tener una buena arquitectura y una buena estructura en Flutter.\n\nQuiero evitar que se creen archivos muy gigantes porque me ha pasado en el pasado que el LLM como que en Flutter crea archivos demasiado grandes. Y pues queremos evitar eso porque para la ventana del contexto de un LLM es mucho más complicado leer un archivo que es muy grande - es más sencillo que el LLM lea archivos pequeños y tenga como que mayor contexto del problema al que se va a enfrentar.\n\nProgreso actual: Parece que ya puedo registrarme, voy a hacer el login. Por ahí lancé unas pruebas de integración también totalmente automatizadas. Ahora mismo estoy viendo la interfaz de usuario, cuál será el mejor diseño. Estoy viendo algunos buenos diseños y los voy a pasar al modelo para que analice las imágenes y a partir de ahí ya me genere pues algo bello. ¡Vamos a ver qué onda raza!"
    },
    {
      "id": 4,
      "timestamp": "2026-02-04T08:45:10Z",
      "title": "Login, Backend y Perfil de Usuario",
      "text": "Al final, si optamos por usar el tema verde, entonces así vamos a diseñar la aplicación con ese tema verde-cinch. Ya logramos crear el login conectado con el backend. Lancé unas pruebas y todo pasó correctamente. También logramos conectar Nodemailer para mandar correos de verificación en el login, con un código de verificación que el usuario debe ingresar cuando se registra.\n\nVi un diseño de navegador, un tabulador (App Tab) en Google que me gustó mucho. El modelo lo replicó muy bien; se ve excelente.\n\nLogré crear la sección de perfil donde se muestran los datos del usuario: correo, nombre, la opción para cambiar contraseña y un botón para cerrar sesión. Sin embargo, el botón para cerrar sesión no está funcionando correctamente; devuelve una excepción. Voy a investigar por qué ocurre esto.\n\nHasta aquí mi reporte.",
      "image": "post/entry-4-app-tab.png",
      "imageCaption": "Diseño del App Tab replicado por el modelo"
    },
    {
      "id": 5,
      "timestamp": "2026-02-05T02:14:37Z",
      "title": "Módulo de Skills, Cronómetro y Rachas",
      "text": "## Resumen del avance del 4 de febrero de 2026\n\nHoy implementamos el módulo completo de **Skills** con las siguientes funcionalidades:\n\n### CRUD de Skills\n- **Crear** un nuevo skill para dar seguimiento a las 10,000 horas\n- **Editar** skill: cambiar título, emoji y color de la interfaz\n- **Eliminar** skills\n\n### Cronómetro de Práctica\nImplementamos un cronómetro que cuenta las horas de práctica en tiempo real:\n- En la interfaz se visualiza el tiempo transcurrido\n- En la app móvil funciona en background con notificaciones mostrando el progreso\n- Al detener el cronómetro se genera automáticamente una nueva entrada de sesión\n\n### Sesiones Manuales\nTambién se puede crear una sesión de forma manual con:\n- Título personalizado\n- Comentarios sobre la práctica\n- Fecha específica\n\n*Aunque el cronómetro es más intuitivo y conveniente.*\n\n### Sistema de Rachas (Streaks)\nAgregamos la funcionalidad de rachas en el header:\n- Muestra el número de días consecutivos de práctica\n- Sirve como incentivo y motivación para no perder la racha\n\n### Visualizador tipo GitHub\nImplementamos un visualizador de actividad estilo GitHub (contribution graph). Por el momento funciona bien, pero se puede mejorar en futuras iteraciones.\n\n---\n\n**Estado:** Las funcionalidades principales están completas. Quedan algunos ajustes de UI por pulir.",
      "image": "post/entry-5-skills-module.png",
      "imageCaption": "Módulo de Skills con cronómetro y visualizador de actividad"
    },
    {
      "id": 6,
      "timestamp": "2026-02-05T08:45:04Z",
      "title": "Temporizador Minimalista y Módulo de Resumen",
      "text": "## Avances del 5 de febrero de 2026\n\nHoy trabajamos en varias mejoras importantes para la experiencia de usuario.\n\n### Temporizador Rediseñado\nEl temporizador ahora es **más minimalista** porque la versión anterior ocupaba demasiado espacio en pantalla:\n- Corre en **background** cuando cierras la aplicación\n- Muestra el progreso en las **notificaciones** del sistema\n- Al dar clic en la notificación, abre la app automáticamente\n\n### Nueva Navegación (Tab Nav)\nRediseñamos el navegador inferior con tres secciones:\n- 🏠 **Home** - Casita como pantalla principal\n- ❤️ **Resumen General** - Nuevo módulo central\n- 👤 **Perfil** - Configuración del usuario\n\n### Módulo de Resumen General\nEste nuevo módulo muestra estadísticas consolidadas:\n- **Total de horas** acumuladas en todos los skills\n- **Número de skills** que estás trackeando\n- **Media promedio** de horas por skill\n- 📊 **Gráfica de horas por mes** - Visualización del progreso mensual vs mes anterior\n\n### Fecha Estimada de Meta\nAgregamos una característica muy útil:\n- Calcula **cuándo alcanzarás las 10,000 horas** basándose en tu historial\n- Te dice si faltan 10, 20, 140 días... según tu ritmo actual\n\n### Rachas por Skill\nAhora puedes ver la **racha individual** de cada skill en una lista dedicada.\n\n---\n\n**Próximo paso:** Estoy trabajando en un **onboarding para nuevos usuarios** que explicará en qué consiste la app, guiará la creación del primer skill y dará una vista general de las funcionalidades.",
      "image": "post/entry-6-summary-module.png",
      "imageCaption": "Nuevo módulo de resumen general con estadísticas"
    },
    {
      "id": 7,
      "timestamp": "2026-02-06T09:21:02Z",
      "title": "Logo, Rediseño del Home y Compartir en Instagram",
      "text": "## Avances del 6 de febrero de 2026 — Devlog Día 3\n\nHoy fue un día bastante productivo. Trabajamos en identidad visual, mejoras de UX y un feature que creemos va a darle mucha tracción a la app.\n\n### 🎨 Nuevo Logo\nCreamos un logotipo minimalista inspirado en el grid de la app: una cuadrícula con diferentes colores que representan cada skill, acompañada de las letras \"TenK\". Para instalarlo en todas las plataformas (Android, iOS, Web y macOS), utilizamos la librería `flutter_launcher_icons`. Quedó limpio y representa bien el concepto de la app.\n\n### ✨ Animación de Splash\nAgregamos una animación al iniciar la aplicación donde los cuadros del grid se van rellenando uno a uno con color. Se ve muy estético, le da personalidad a la app desde el primer segundo.\n\n### 🏠 Rediseño del Home\nHicimos un rediseño completo de la pantalla principal:\n- **Antes:** Se mostraban todos los cuadros de las 10,000 horas de golpe, lo cual resultaba abrumador y desmotivante para el usuario.\n- **Ahora:** Primero aparece todo el progreso real del usuario, seguido de unos pocos cuadros vacíos. Se agregó un botón para ver la cuadrícula completa en una pantalla separada.\n- El resultado es una vista mucho más limpia y motivadora.\n\n### 📸 Compartir Progreso en Instagram Stories\nImplementamos la funcionalidad de compartir una historia a Instagram con:\n- El **grid de progreso** del skill, donde las horas practicadas hoy se iluminan con mayor brillo.\n- **Total de horas** acumuladas y horas restantes para la meta.\n- **Racha actual** de días consecutivos.\n- **Nivel del usuario** (del nuevo sistema de niveles).\n\nEsta imagen se genera automáticamente y tiene un diseño pensado para verse viral en redes. Creemos que este feature va a darle mucha potencia a la app, ya que los usuarios podrán compartir su progreso de forma visual y atractiva — algo similar a como la gente comparte sus rutas de correr, pero aquí compartimos el grid de horas invertidas.\n\n### 🏆 Sistema de Niveles\nAgregamos 5 niveles de maestría:\n1. **Principiante**\n2. **Aprendiz**\n3. **Intermedio**\n4. **Avanzado**\n5. **Master**\n\nAdemás, en la interfaz mostramos cuántas horas faltan para alcanzar el siguiente nivel, lo que añade un elemento extra de motivación para el usuario.\n\n---\n\n**Próximo paso:** Desplegar la app en Google Play como MVP funcional. Todo parece estar funcionando correctamente. Vamos a preparar el lanzamiento para testing cerrado con 12 personas, que es el mínimo que requiere Google para el programa de pruebas internas.",
      "image": "post/post7.png",
      "imageCaption": "Logo, rediseño del Home y compartir progreso en Instagram Stories"
    }
  ]
}
