{
  "postId": "10k-hours-tracker",
  "entries": [
    {
      "id": 1,
      "timestamp": "2026-02-04T00:00:00Z",
      "title": "Idea: Aplicación 10K Hours Tracker",
      "text": "Se me ocurrió crear una aplicación para trackear las horas que dedico a diferentes temas o habilidades. La inspiración viene de la Teoría de las 10,000 horas de Malcolm Gladwell, que propone que se necesitan aproximadamente 10,000 horas de práctica deliberada para alcanzar el nivel de experto en cualquier disciplina.\n\nConcepto de la interfaz: La visualización estaría inspirada en el contribution graph de GitHub (ese calendario con cuadros verdes que muestra la actividad de commits). Quiero que el usuario pueda ver su progreso de forma visual y clara, similar a cómo GitHub representa la actividad diaria.\n\nFuncionalidad principal: El usuario podrá registrar su progreso día a día. Por ejemplo: 'Hoy practiqué 3 horas de piano' se registra, y la app irá acumulando y visualizando todo el historial de práctica, mostrando el avance hacia la meta de las 10,000 horas.\n\nPróximos pasos: Tengo planeada una integración adicional con IA, pero eso lo detallaré en la siguiente nota."
    },
    {
      "id": 2,
      "timestamp": "2026-02-04T01:00:00Z",
      "title": "Stack Técnico y Primeros Pasos",
      "text": "Durante estas sesiones iré documentando todo el progreso del desarrollo. Será una app Android por el momento, ya que es más sencillo desplegarla.\n\nMetodología: El desarrollo será principalmente mediante vibe coding - yo genero las instrucciones y Claude Sonnet 4.5 se encarga de escribir todo el código, la base de datos, y los requerimientos técnicos/funcionales. El objetivo es no escribir absolutamente una sola línea de código manualmente.\n\nStack tecnológico: Runtime Bun (extremadamente rápido), Backend con Hono (framework web), Base de datos PostgreSQL, y ORM Prisma.\n\nEsquema de base de datos actual: Claude Code ya generó un esquema inicial bastante bueno con tres tablas principales: User (tabla de usuarios), Skills (los temas o habilidades que queremos trackear, ej: piano, programación), y Sessions (las horas registradas, relacionadas a cada skill).\n\nEstado actual: Estoy trabajando en los endpoints de registro de usuario. Ya tengo los requerimientos técnicos definidos y voy a crear pruebas automatizadas para validar el flujo de registro."
    },
    {
      "id": 3,
      "timestamp": "2026-02-04T02:00:00Z",
      "title": "Diseño UI, Flutter y Arquitectura Limpia",
      "text": "He estado revisando algunos temas y paletas de color para ver cómo pudiera hacer la aplicación. Estoy pensando seriamente en un verde, pero no lo sé, como con verdes un poco raro pero probablemente sí, dependiendo de cómo se vea. Por ahí voy a decirle a Claude que me genere un tema para Flutter.\n\nYo la neta no sé nada de Flutter, literal no sé nada de Flutter. Entonces ¿cómo le voy a hacer para saber si voy por el lugar correcto, que está escribiendo las instrucciones correctas? Pues por ahí utilicé instrucciones bien definidas que investigué, o que la misma gente también investigó y que sabe cómo tener una buena arquitectura y una buena estructura en Flutter.\n\nQuiero evitar que se creen archivos muy gigantes porque me ha pasado en el pasado que el LLM como que en Flutter crea archivos demasiado grandes. Y pues queremos evitar eso porque para la ventana del contexto de un LLM es mucho más complicado leer un archivo que es muy grande - es más sencillo que el LLM lea archivos pequeños y tenga como que mayor contexto del problema al que se va a enfrentar.\n\nProgreso actual: Parece que ya puedo registrarme, voy a hacer el login. Por ahí lancé unas pruebas de integración también totalmente automatizadas. Ahora mismo estoy viendo la interfaz de usuario, cuál será el mejor diseño. Estoy viendo algunos buenos diseños y los voy a pasar al modelo para que analice las imágenes y a partir de ahí ya me genere pues algo bello. ¡Vamos a ver qué onda raza!"
    },
    {
      "id": 4,
      "timestamp": "2026-02-04T08:45:10Z",
      "title": "Login, Backend y Perfil de Usuario",
      "text": "Al final, si optamos por usar el tema verde, entonces así vamos a diseñar la aplicación con ese tema verde-cinch. Ya logramos crear el login conectado con el backend. Lancé unas pruebas y todo pasó correctamente. También logramos conectar Nodemailer para mandar correos de verificación en el login, con un código de verificación que el usuario debe ingresar cuando se registra.\n\nVi un diseño de navegador, un tabulador (App Tab) en Google que me gustó mucho. El modelo lo replicó muy bien; se ve excelente.\n\nLogré crear la sección de perfil donde se muestran los datos del usuario: correo, nombre, la opción para cambiar contraseña y un botón para cerrar sesión. Sin embargo, el botón para cerrar sesión no está funcionando correctamente; devuelve una excepción. Voy a investigar por qué ocurre esto.\n\nHasta aquí mi reporte.",
      "image": "post/entry-4-app-tab.png",
      "imageCaption": "Diseño del App Tab replicado por el modelo"
    }
  ]
}
