{
  "postId": "10k-hours-tracker",
  "entries": [
    {
      "id": 1,
      "timestamp": "2026-02-04T00:00:00Z",
      "title": "Idea: Aplicación 10K Hours Tracker",
      "text": "Se me ocurrió crear una aplicación para trackear las horas que dedico a diferentes temas o habilidades. La inspiración viene de la Teoría de las 10,000 horas de Malcolm Gladwell, que propone que se necesitan aproximadamente 10,000 horas de práctica deliberada para alcanzar el nivel de experto en cualquier disciplina.\n\nConcepto de la interfaz: La visualización estaría inspirada en el contribution graph de GitHub (ese calendario con cuadros verdes que muestra la actividad de commits). Quiero que el usuario pueda ver su progreso de forma visual y clara, similar a cómo GitHub representa la actividad diaria.\n\nFuncionalidad principal: El usuario podrá registrar su progreso día a día. Por ejemplo: 'Hoy practiqué 3 horas de piano' se registra, y la app irá acumulando y visualizando todo el historial de práctica, mostrando el avance hacia la meta de las 10,000 horas.\n\nPróximos pasos: Tengo planeada una integración adicional con IA, pero eso lo detallaré en la siguiente nota."
    },
    {
      "id": 2,
      "timestamp": "2026-02-04T01:00:00Z",
      "title": "Stack Técnico y Primeros Pasos",
      "text": "Durante estas sesiones iré documentando todo el progreso del desarrollo. Será una app Android por el momento, ya que es más sencillo desplegarla.\n\nMetodología: El desarrollo será principalmente mediante vibe coding - yo genero las instrucciones y Claude Sonnet 4.5 se encarga de escribir todo el código, la base de datos, y los requerimientos técnicos/funcionales. El objetivo es no escribir absolutamente una sola línea de código manualmente.\n\nStack tecnológico: Runtime Bun (extremadamente rápido), Backend con Hono (framework web), Base de datos PostgreSQL, y ORM Prisma.\n\nEsquema de base de datos actual: Claude Code ya generó un esquema inicial bastante bueno con tres tablas principales: User (tabla de usuarios), Skills (los temas o habilidades que queremos trackear, ej: piano, programación), y Sessions (las horas registradas, relacionadas a cada skill).\n\nEstado actual: Estoy trabajando en los endpoints de registro de usuario. Ya tengo los requerimientos técnicos definidos y voy a crear pruebas automatizadas para validar el flujo de registro."
    },
    {
      "id": 3,
      "timestamp": "2026-02-04T02:00:00Z",
      "title": "Diseño UI, Flutter y Arquitectura Limpia",
      "text": "He estado revisando algunos temas y paletas de color para ver cómo pudiera hacer la aplicación. Estoy pensando seriamente en un verde, pero no lo sé, como con verdes un poco raro pero probablemente sí, dependiendo de cómo se vea. Por ahí voy a decirle a Claude que me genere un tema para Flutter.\n\nYo la neta no sé nada de Flutter, literal no sé nada de Flutter. Entonces ¿cómo le voy a hacer para saber si voy por el lugar correcto, que está escribiendo las instrucciones correctas? Pues por ahí utilicé instrucciones bien definidas que investigué, o que la misma gente también investigó y que sabe cómo tener una buena arquitectura y una buena estructura en Flutter.\n\nQuiero evitar que se creen archivos muy gigantes porque me ha pasado en el pasado que el LLM como que en Flutter crea archivos demasiado grandes. Y pues queremos evitar eso porque para la ventana del contexto de un LLM es mucho más complicado leer un archivo que es muy grande - es más sencillo que el LLM lea archivos pequeños y tenga como que mayor contexto del problema al que se va a enfrentar.\n\nProgreso actual: Parece que ya puedo registrarme, voy a hacer el login. Por ahí lancé unas pruebas de integración también totalmente automatizadas. Ahora mismo estoy viendo la interfaz de usuario, cuál será el mejor diseño. Estoy viendo algunos buenos diseños y los voy a pasar al modelo para que analice las imágenes y a partir de ahí ya me genere pues algo bello. ¡Vamos a ver qué onda raza!"
    },
    {
      "id": 4,
      "timestamp": "2026-02-04T08:45:10Z",
      "title": "Login, Backend y Perfil de Usuario",
      "text": "Al final, si optamos por usar el tema verde, entonces así vamos a diseñar la aplicación con ese tema verde-cinch. Ya logramos crear el login conectado con el backend. Lancé unas pruebas y todo pasó correctamente. También logramos conectar Nodemailer para mandar correos de verificación en el login, con un código de verificación que el usuario debe ingresar cuando se registra.\n\nVi un diseño de navegador, un tabulador (App Tab) en Google que me gustó mucho. El modelo lo replicó muy bien; se ve excelente.\n\nLogré crear la sección de perfil donde se muestran los datos del usuario: correo, nombre, la opción para cambiar contraseña y un botón para cerrar sesión. Sin embargo, el botón para cerrar sesión no está funcionando correctamente; devuelve una excepción. Voy a investigar por qué ocurre esto.\n\nHasta aquí mi reporte.",
      "image": "post/entry-4-app-tab.png",
      "imageCaption": "Diseño del App Tab replicado por el modelo"
    },
    {
      "id": 5,
      "timestamp": "2026-02-05T02:14:37Z",
      "title": "Módulo de Skills, Cronómetro y Rachas",
      "text": "## Resumen del avance del 4 de febrero de 2026\n\nHoy implementamos el módulo completo de **Skills** con las siguientes funcionalidades:\n\n### CRUD de Skills\n- **Crear** un nuevo skill para dar seguimiento a las 10,000 horas\n- **Editar** skill: cambiar título, emoji y color de la interfaz\n- **Eliminar** skills\n\n### Cronómetro de Práctica\nImplementamos un cronómetro que cuenta las horas de práctica en tiempo real:\n- En la interfaz se visualiza el tiempo transcurrido\n- En la app móvil funciona en background con notificaciones mostrando el progreso\n- Al detener el cronómetro se genera automáticamente una nueva entrada de sesión\n\n### Sesiones Manuales\nTambién se puede crear una sesión de forma manual con:\n- Título personalizado\n- Comentarios sobre la práctica\n- Fecha específica\n\n*Aunque el cronómetro es más intuitivo y conveniente.*\n\n### Sistema de Rachas (Streaks)\nAgregamos la funcionalidad de rachas en el header:\n- Muestra el número de días consecutivos de práctica\n- Sirve como incentivo y motivación para no perder la racha\n\n### Visualizador tipo GitHub\nImplementamos un visualizador de actividad estilo GitHub (contribution graph). Por el momento funciona bien, pero se puede mejorar en futuras iteraciones.\n\n---\n\n**Estado:** Las funcionalidades principales están completas. Quedan algunos ajustes de UI por pulir.",
      "image": "post/entry-5-skills-module.png",
      "imageCaption": "Módulo de Skills con cronómetro y visualizador de actividad"
    },
    {
      "id": 6,
      "timestamp": "2026-02-05T08:45:04Z",
      "title": "Temporizador Minimalista y Módulo de Resumen",
      "text": "## Avances del 5 de febrero de 2026\n\nHoy trabajamos en varias mejoras importantes para la experiencia de usuario.\n\n### Temporizador Rediseñado\nEl temporizador ahora es **más minimalista** porque la versión anterior ocupaba demasiado espacio en pantalla:\n- Corre en **background** cuando cierras la aplicación\n- Muestra el progreso en las **notificaciones** del sistema\n- Al dar clic en la notificación, abre la app automáticamente\n\n### Nueva Navegación (Tab Nav)\nRediseñamos el navegador inferior con tres secciones:\n- 🏠 **Home** - Casita como pantalla principal\n- ❤️ **Resumen General** - Nuevo módulo central\n- 👤 **Perfil** - Configuración del usuario\n\n### Módulo de Resumen General\nEste nuevo módulo muestra estadísticas consolidadas:\n- **Total de horas** acumuladas en todos los skills\n- **Número de skills** que estás trackeando\n- **Media promedio** de horas por skill\n- 📊 **Gráfica de horas por mes** - Visualización del progreso mensual vs mes anterior\n\n### Fecha Estimada de Meta\nAgregamos una característica muy útil:\n- Calcula **cuándo alcanzarás las 10,000 horas** basándose en tu historial\n- Te dice si faltan 10, 20, 140 días... según tu ritmo actual\n\n### Rachas por Skill\nAhora puedes ver la **racha individual** de cada skill en una lista dedicada.\n\n---\n\n**Próximo paso:** Estoy trabajando en un **onboarding para nuevos usuarios** que explicará en qué consiste la app, guiará la creación del primer skill y dará una vista general de las funcionalidades.",
      "image": "post/entry-6-summary-module.png",
      "imageCaption": "Nuevo módulo de resumen general con estadísticas"
    },
    {
      "id": 7,
      "timestamp": "2026-02-06T09:21:02Z",
      "title": "Logo, Rediseño del Home y Compartir en Instagram",
      "text": "## Avances del 6 de febrero de 2026 — Devlog Día 3\n\nHoy fue un día bastante productivo. Trabajamos en identidad visual, mejoras de UX y un feature que creemos va a darle mucha tracción a la app.\n\n### 🎨 Nuevo Logo\nCreamos un logotipo minimalista inspirado en el grid de la app: una cuadrícula con diferentes colores que representan cada skill, acompañada de las letras \"TenK\". Para instalarlo en todas las plataformas (Android, iOS, Web y macOS), utilizamos la librería `flutter_launcher_icons`. Quedó limpio y representa bien el concepto de la app.\n\n### ✨ Animación de Splash\nAgregamos una animación al iniciar la aplicación donde los cuadros del grid se van rellenando uno a uno con color. Se ve muy estético, le da personalidad a la app desde el primer segundo.\n\n### 🏠 Rediseño del Home\nHicimos un rediseño completo de la pantalla principal:\n- **Antes:** Se mostraban todos los cuadros de las 10,000 horas de golpe, lo cual resultaba abrumador y desmotivante para el usuario.\n- **Ahora:** Primero aparece todo el progreso real del usuario, seguido de unos pocos cuadros vacíos. Se agregó un botón para ver la cuadrícula completa en una pantalla separada.\n- El resultado es una vista mucho más limpia y motivadora.\n\n### 📸 Compartir Progreso en Instagram Stories\nImplementamos la funcionalidad de compartir una historia a Instagram con:\n- El **grid de progreso** del skill, donde las horas practicadas hoy se iluminan con mayor brillo.\n- **Total de horas** acumuladas y horas restantes para la meta.\n- **Racha actual** de días consecutivos.\n- **Nivel del usuario** (del nuevo sistema de niveles).\n\nEsta imagen se genera automáticamente y tiene un diseño pensado para verse viral en redes. Creemos que este feature va a darle mucha potencia a la app, ya que los usuarios podrán compartir su progreso de forma visual y atractiva — algo similar a como la gente comparte sus rutas de correr, pero aquí compartimos el grid de horas invertidas.\n\n### 🏆 Sistema de Niveles\nAgregamos 5 niveles de maestría:\n1. **Principiante**\n2. **Aprendiz**\n3. **Intermedio**\n4. **Avanzado**\n5. **Master**\n\nAdemás, en la interfaz mostramos cuántas horas faltan para alcanzar el siguiente nivel, lo que añade un elemento extra de motivación para el usuario.\n\n---\n\n**Próximo paso:** Desplegar la app en Google Play como MVP funcional. Todo parece estar funcionando correctamente. Vamos a preparar el lanzamiento para testing cerrado con 12 personas, que es el mínimo que requiere Google para el programa de pruebas internas.",
      "image": "post/post7.png",
      "imageCaption": "Logo, rediseño del Home y compartir progreso en Instagram Stories"
    },
    {
      "id": 8,
      "timestamp": "2026-02-10T23:32:55Z",
      "title": "Google Play, Infraestructura Cloud y Técnica Pomodoro",
      "text": "## Avances del 10 de febrero de 2026 — Devlog Día 7\n\nHoy fue un día clave: la app ya está desplegada en Google Play Console y la infraestructura cloud quedó lista. Además, trabajamos en mejoras importantes de UX y en la landing page.\n\n### 🚀 Despliegue en Google Play Console\nLogramos completar todo el proceso de despliegue en la **Google Play Console** en modo testing:\n- Llenamos todos los requisitos obligatorios: política de privacidad, clasificación de contenido y cuestionarios de seguridad de datos.\n- Subimos el **logo de la aplicación**, las **capturas de pantalla** y la **portada** (diseño generado con IA).\n- La app ya está disponible para el programa de pruebas internas.\n\n### ☁️ Infraestructura y Dominio\nConfiguramos el dominio **tenk.oventlabs.com** con una arquitectura cloud robusta:\n- **Balanceador de carga** con un target group apuntando a la instancia y al puerto donde corre la aplicación.\n- **Certificados SSL** configurados en el balanceador de carga para servir tráfico HTTPS.\n- **Reglas de enrutamiento** basadas en el header del host: cuando se accede a `tenk.oventlabs.com`, el tráfico se redirige a la instancia correspondiente.\n- **Registros DNS** configurados en el hosting para apuntar al balanceador de carga.\n\n### 🔄 Proxy Reverso con Nginx\nConfiguramos **Nginx como proxy reverso** para unificar las rutas de la app y la API bajo el mismo dominio:\n- La API corre en un **contenedor Docker** dentro del servidor.\n- Al acceder a `tenk.oventlabs.com/api`, Nginx redirige las peticiones al contenedor correspondiente.\n- Esto simplifica la comunicación entre el frontend y el backend, eliminando problemas de CORS y manteniendo una URL limpia.\n\n### 🍅 Técnica Pomodoro en el Cronómetro\nAgregamos la **técnica Pomodoro** al temporizador de práctica:\n- **25 minutos** de práctica enfocada\n- **5 minutos** de descanso entre sesiones\n- Después de **4 sesiones**, un descanso largo de **15 minutos**\n- Los usuarios ahora pueden estructurar su práctica deliberada siguiendo esta metodología probada de productividad.\n\n### 🌐 Landing Page y Lista de Acceso Anticipado\nCreamos una **landing page** en [tenk.oventlabs.com](https://tenk.oventlabs.com) con:\n- Explicación clara del **funcionamiento principal** de la aplicación.\n- Botón para unirse a la **lista de acceso anticipado** con el ícono de Google Play Store.\n- Los usuarios pueden **registrarse desde la web** sin necesidad de descargar la app.\n- La landing page permite que las personas conozcan la app y reserven su lugar antes del lanzamiento público.\n\n---\n\n**Estado:** La app ya está en Google Play (testing), la infraestructura cloud está operativa y la landing page está recibiendo registros. ¡Vamos con todo! 🔥",
      "images": [
        {
          "src": "post/post9phone.png",
          "caption": "Captura de pantalla de la app móvil — Vista principal"
        },
        {
          "src": "post/post9phone2.png",
          "caption": "Captura de pantalla de la app móvil — Técnica Pomodoro"
        },
        {
          "src": "post/web.png",
          "caption": "Landing page — Versión web con registro de acceso anticipado"
        }
      ]
    },
    {
      "id": 9,
      "timestamp": "2026-02-10T23:59:00Z",
      "title": "AI Coach: Integrando Claude como Entrenador Personal de Skills",
      "text": "## Avances del 10 de febrero de 2026 — Devlog: AI Coach\n\nEsta es probablemente la feature más ambiciosa que hemos construido hasta ahora. La app TenK ahora tiene un **AI Coach** integrado que analiza tus datos de práctica y te da recomendaciones personalizadas. Y lo mejor: funciona con tu propia cuenta de Claude.\n\n---\n\n### 🧠 ¿Qué es el AI Coach?\n\nEs un agente de IA con acceso a tus datos reales mediante **tool calling**. No es un chatbot genérico — el agente tiene 5 herramientas que consultan tu base de datos:\n\n| Tool | Descripción |\n|------|-------------|\n| `get_user_skills` | Skills del usuario con horas totales, nivel de maestría y estado |\n| `get_practice_sessions` | Sesiones de práctica de un skill específico (últimos N días) |\n| `get_journey_stats` | Estadísticas globales: promedio semanal, mejores días, proyecciones, rachas |\n| `analyze_practice_patterns` | Distribución por día de semana, tendencias, gaps, diagnóstico de plateau |\n| `save_weekly_plan` | Guarda un plan semanal con insights en la base de datos |\n\nEl agente opera en un **loop de hasta 5 iteraciones** de tool calling. En cada iteración, Claude decide qué herramientas invocar, recibe los resultados, y puede hacer más llamadas o generar la respuesta final.\n\n```typescript\n// agent-runner.ts — Loop principal\nfor (let i = 0; i < MAX_TOOL_ITERATIONS; i++) {\n  const result = await chatCompletion(messages, AGENT_TOOLS, userId);\n\n  if (result.toolCalls.length === 0) {\n    return { response: result.content, toolsUsed, provider, usage };\n  }\n\n  messages.push({ role: 'assistant', content: result.content, tool_calls: result.toolCalls });\n\n  for (const toolCall of result.toolCalls) {\n    const toolResult = await executeTool(toolCall.function.name, userId, args);\n    messages.push({ role: 'tool', content: JSON.stringify(toolResult), tool_call_id: toolCall.id });\n  }\n}\n```\n\nCada herramienta recibe el `userId` para **aislamiento de datos** — un usuario nunca puede ver datos de otro.\n\n---\n\n### 🔐 OAuth PKCE con Claude: La Parte Difícil\n\nEn lugar de usar una API key centralizada (que comparte rate limits entre todos), implementamos un flujo **OAuth PKCE** donde cada usuario conecta su propia cuenta de Claude Pro o Max.\n\n#### El flujo completo:\n1. El usuario toca el ícono de conexión en la pantalla del coach.\n2. El backend genera un `code_verifier` (64 chars random) y su `code_challenge` (SHA-256 + base64url).\n3. Se abre el navegador con la URL de autorización de Claude.\n4. El usuario se logea con su cuenta de Anthropic y autoriza.\n5. Claude muestra un código en formato `code#state` que el usuario pega en la app.\n6. El backend parsea el `#`, valida el `state` contra la DB, e intercambia el código por tokens.\n\n#### Generación PKCE\n```typescript\nfunction generateRandomString(length: number): string {\n  const chars = 'ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789-._~';\n  const bytes = crypto.getRandomValues(new Uint8Array(length));\n  return Array.from(bytes, (b) => chars[b % chars.length]).join('');\n}\n\nasync function generateCodeChallenge(verifier: string): Promise<string> {\n  const data = new TextEncoder().encode(verifier);\n  const digest = await crypto.subtle.digest('SHA-256', data);\n  return btoa(String.fromCharCode(...new Uint8Array(digest)))\n    .replace(/\\+/g, '-').replace(/\\//g, '_').replace(/=+$/, '');\n}\n```\n\n#### Parsing `code#state` — La trampa de Anthropic\nAnthropic devuelve el código de autorización en formato `code#state` como un solo string. Nadie documenta esto. Lo descubrimos debuggeando:\n\n```typescript\nasync handleCodeExchange(userId: string, rawCode: string): Promise<void> {\n  const hashIndex = rawCode.indexOf('#');\n  if (hashIndex === -1) {\n    throw new BadRequestError('Formato de código inválido');\n  }\n  const code = rawCode.substring(0, hashIndex);\n  const state = rawCode.substring(hashIndex + 1);\n  // Validate state against DB, exchange tokens...\n}\n```\n\n#### Token Exchange — JSON, no form-urlencoded\nAnthropic es el **único proveedor OAuth** que requiere `Content-Type: application/json` en el token exchange. Todos los demás (Google, GitHub, etc.) usan `application/x-www-form-urlencoded`.\n\n```typescript\nconst res = await fetch('https://console.anthropic.com/v1/oauth/token', {\n  method: 'POST',\n  headers: { 'Content-Type': 'application/json' },\n  body: JSON.stringify({\n    grant_type: 'authorization_code',\n    client_id: CLAUDE_CLIENT_ID,\n    code,\n    state,                    // <- necesario en el body\n    redirect_uri: REDIRECT_URI,\n    code_verifier: codeVerifier,\n  }),\n});\n```\n\nNota: el `state` va en el body también. Otro detalle no documentado.\n\n#### Modelos de base de datos\n```prisma\nmodel ClaudeCredential {\n  id           String   @id @default(cuid())\n  userId       String   @unique @map(\"user_id\")\n  accessToken  String   @map(\"access_token\") @db.Text\n  refreshToken String   @map(\"refresh_token\") @db.Text\n  expiresAt    DateTime @map(\"expires_at\")\n  user User @relation(fields: [userId], references: [id], onDelete: Cascade)\n  @@map(\"claude_credentials\")\n}\n\nmodel OAuthState {\n  id            String   @id @default(cuid())\n  userId        String   @map(\"user_id\")\n  state         String   @unique\n  codeVerifier  String   @map(\"code_verifier\")\n  expiresAt     DateTime @map(\"expires_at\")\n  @@map(\"oauth_states\")\n  @@index([state])\n}\n```\n\n---\n\n### 🕵️ Stealth Headers — Haciéndose pasar por Claude Code CLI\n\nLos tokens OAuth de Claude **solo funcionan** si el request parece venir del CLI oficial. Detectamos esto investigando el código fuente de OpenClaw y capturando las llamadas reales del CLI.\n\n```typescript\nconst isOAuth = credential.accessToken.includes('sk-ant-oat');\n\nif (isOAuth) {\n  headers['Authorization'] = `Bearer ${credential.accessToken}`;\n  headers['anthropic-dangerous-direct-browser-access'] = 'true';\n  headers['anthropic-beta'] = 'claude-code-20250219,oauth-2025-04-20,' +\n    'fine-grained-tool-streaming-2025-05-14';\n  headers['user-agent'] = 'claude-cli/2.1.2 (external, cli)';\n  headers['x-app'] = 'cli';\n\n  // El system prompt DEBE abrir con la identidad de Claude Code\n  body.system = [\n    { type: 'text', text: 'You are Claude Code, Anthropic\\'s official CLI for Claude.' },\n    { type: 'text', text: systemPrompt },\n  ];\n} else {\n  headers['x-api-key'] = credential.accessToken;\n  body.system = systemPrompt;\n}\n```\n\nSin estos headers, Anthropic rechaza el token con `403 Forbidden`.\n\n---\n\n### 🛡️ Rate Limits — De Error Críptico a Banner Elegante\n\n#### El problema\nCuando el usuario agota su sesión de Claude, la API devuelve un `429` con un header `retry-after`. Sin manejo adecuado, el usuario veía:\n\n```\nDioException [bad response]: The request returned an invalid status code of 429.\nHeaders: {retry-after: 2520, ...}\n```\n\n#### La solución (Backend)\n3 reintentos con backoff (cap 15s). Si `retry-after` > 60s, falla inmediato con los minutos de espera:\n\n```typescript\nif (res.status === 429) {\n  const retryAfter = res.headers.get('retry-after');\n  const rawWaitMs = retryAfter ? Number(retryAfter) * 1000 : (attempt + 1) * 5000;\n  const minutes = Math.max(1, Math.ceil(rawWaitMs / 60000));\n\n  if (rawWaitMs > 60000) {\n    throw new TooManyRequestsError(\n      `Has alcanzado el límite de uso de Claude. Intenta en ~${minutes} min.`,\n      minutes,  // <- este campo viaja al frontend\n    );\n  }\n  // ... retry con backoff\n}\n```\n\nEl middleware de errores incluye `retryAfterMinutes` en el JSON de respuesta:\n```json\n{ \"success\": false, \"error\": { \"code\": \"TOO_MANY_REQUESTS\", \"message\": \"...\", \"retryAfterMinutes\": 42 } }\n```\n\n#### La solución (Flutter)\nEl repositorio extrae `retryAfterMinutes` del response y crea un `RateLimitFailure` tipado:\n\n```dart\nif (statusCode == 429) {\n  final retryMinutes = errorData?['retryAfterMinutes'] as int?;\n  return RateLimitFailure(\n    message: message,\n    retryAfterMinutes: retryMinutes,\n  );\n}\n```\n\nEl BLoC detecta este failure específico y emite un estado `rateLimited` en vez de `error`:\n```dart\nif (failure is RateLimitFailure) {\n  emit(state.copyWith(\n    status: AiCoachStatus.rateLimited,\n    retryAfterMinutes: failure.retryAfterMinutes,\n  ));\n}\n```\n\nY la UI muestra un banner amigable con gradiente amber, ícono de timer, y los minutos de espera.\n\n---\n\n### 🏗️ Arquitectura Completa\n\n**Backend (Bun + Hono + Prisma):**\n```\nmodules/\n├── ai/\n│   ├── ai.controller.ts        # Endpoints: POST /chat, POST /weekly-plan\n│   ├── ai.service.ts            # Orquesta el agent runner\n│   ├── agent/\n│   │   ├── agent-runner.ts      # Loop de tool calling (max 5 iteraciones)\n│   │   ├── system-prompt.ts     # Prompt del TenK Coach\n│   │   ├── tool-definitions.ts  # 5 tools con JSON Schema\n│   │   └── tool-executor.ts     # Dispatcher de tools\n│   └── tools/\n│       ├── query-skills.tool.ts\n│       ├── query-sessions.tool.ts\n│       ├── get-stats.tool.ts\n│       ├── analyze-patterns.tool.ts\n│       └── create-plan.tool.ts\n├── claude-oauth/\n│   ├── claude-oauth.controller.ts  # POST /init, POST /exchange, GET /status, DELETE /disconnect\n│   ├── claude-oauth.service.ts     # PKCE, token exchange, refresh\n│   ├── claude-oauth.repository.ts  # Prisma ops\n│   ├── claude-oauth.schema.ts      # Zod validation\n│   └── claude-oauth.types.ts\nlib/\n└── ai-client.ts                 # Per-user tokens → stealth headers → retry\n```\n\n**Flutter (Clean Architecture):**\n```\nfeatures/ai_coach/\n├── data/\n│   ├── datasources/\n│   │   ├── ai_coach_remote_datasource.dart\n│   │   └── claude_oauth_datasource.dart\n│   ├── models/\n│   └── repositories/\n│       └── ai_coach_repository_impl.dart  # _handleDioError → RateLimitFailure\n├── domain/\n│   ├── entities/\n│   ├── repositories/\n│   └── usecases/\n└── presentation/\n    ├── bloc/\n    │   ├── ai_coach_bloc.dart     # Estados: initial, sending, success, error, rateLimited\n    │   ├── ai_coach_event.dart    # SendMessage, DismissRateLimit, etc.\n    │   └── ai_coach_state.dart    # retryAfterMinutes field\n    ├── pages/\n    │   └── ai_coach_screen.dart   # Ícono dinámico verde/gris\n    └── widgets/\n        ├── rate_limit_banner.dart\n        ├── claude_connect_sheet.dart\n        ├── chat_message_bubble.dart\n        └── coach_empty_state.dart\n```\n\n---\n\n### 💡 Lo que aprendimos\n\n1. **Anthropic es el único proveedor OAuth** que usa JSON en vez de form-urlencoded para el token exchange.\n2. El formato `code#state` no está documentado — hay que parsear el `#` manualmente.\n3. El `state` debe ir en el body del token exchange — otro detalle no documentado.\n4. Los tokens OAuth necesitan **5 headers stealth** y un system prompt de identidad.\n5. El `client_id` de Claude Code CLI es **público** (`9d1c250a-...`) — identifica la app, no al usuario.\n6. Los rate limits de Claude son **por suscripción** — el modelo per-user evita que un usuario bloquee a todos.\n7. El manejo de errores end-to-end requiere tipado estricto: `429 API → TooManyRequestsError(minutes) → JSON response → DioException → RateLimitFailure → AiCoachStatus.rateLimited → RateLimitBanner`.\n\n---\n\n**Estado:** El AI Coach está funcional con tool calling (5 herramientas), OAuth PKCE per-user, stealth headers, y manejo elegante de rate limits en toda la cadena. Cada usuario conecta su propia cuenta de Claude y obtiene coaching personalizado basado en sus datos reales de práctica. 🚀\n\n---\n\n### ⚡ Optimización del Weekly Plan: 39s → 8s\n\nEl plan semanal inicialmente tomaba **39 segundos** porque el agente ejecutaba **6 llamadas secuenciales** a la API de Anthropic (una por iteración del tool loop). Cada iteración: Claude decide qué tool usar → ejecuta → recibe resultado → decide otra tool → repite.\n\n#### La solución: Pre-fetch + Single Call\nCreamos un servicio dedicado (`weekly-plan.service.ts`) que:\n1. **Pre-fetcha todos los datos en paralelo** con `Promise.all` (~50ms): skills, estadísticas y patrones de práctica.\n2. **Embebe los datos como JSON** directamente en el prompt.\n3. Hace **una sola llamada** a Claude con toda la información necesaria.\n\n```typescript\n// Antes: 6 API calls secuenciales (39s)\nfor (let i = 0; i < MAX_ITERATIONS; i++) {\n  const result = await chatCompletion(messages, tools);\n  // Claude pide un tool → ejecuta → otra iteración...\n}\n\n// Después: 1 API call con datos pre-cargados (8s)\nconst [skills, stats, patterns] = await Promise.all([\n  querySkills(userId),\n  getJourneyStats(userId),\n  analyzePracticePatterns(userId),\n]);\nconst prompt = buildWeeklyPlanPrompt(skills, stats, patterns);\nconst result = await chatCompletion([{ role: 'user', content: prompt }]);\n```\n\nResultado: **4.7x más rápido** — de 39 segundos a ~8 segundos.\n\n---\n\n### 🔌 Fix de Conexión: Bun idleTimeout\n\nDescubrimos un bug sutil: Bun tiene un `idleTimeout` predeterminado de **10 segundos** que mata conexiones TCP \"inactivas\". Durante el agent loop del AI Coach (que toma más de 10s), el socket se cerraba y Flutter recibía un error de conexión — aunque Claude ya había consumido tokens.\n\n```typescript\n// src/index.ts\nexport default {\n  port: env.PORT,\n  fetch: app.fetch,\n  idleTimeout: 255,  // <- fix: 255 segundos en vez de 10\n};\n```\n\nTambién agregamos:\n- **Flutter Dio**: `receiveTimeout: Duration(minutes: 3)` específicamente para endpoints de IA.\n- **Agent timeout**: `Promise.race` con 150s como guard de seguridad.\n- **Platform-aware baseUrl**: Detección de `TargetPlatform.android` vs iOS/macOS para usar la URL correcta en modo development.\n\n---\n\n### 🐛 Fix: Null Cast en Flutter\n\nAl optimizar el weekly plan (de agent loop a single call), el endpoint dejó de enviar `conversationId` y `provider` en la respuesta. El modelo de Flutter hacía `json['conversationId'] as String` que crasheaba con:\n\n```\ntype 'Null' is not a subtype of type 'String' in type cast\n```\n\nFix: hacer ambos campos nullable (`String?`) en la entidad y el modelo de datos."
    },
    {
      "id": 10,
      "timestamp": "2026-02-11T02:00:00Z",
      "title": "Versión Web: Sidebar Persistente, Tabla Rediseñada y Status del AI Coach",
      "text": "## Avances del 11 de febrero de 2026 — Devlog Día 8\n\nHoy trabajamos en pulir la experiencia web de TenK y en hacer que la integración del AI Coach sea más visible y accesible para el usuario.\n\n---\n\n### 🔧 Fix: Plan Semanal Cortado por la Navegación\n\nEl contenido del plan semanal se cortaba al final porque el floating bottom nav bar lo tapaba. La causa era que el `ListView` solo tenía 12px de padding inferior, mientras que la barra de navegación ocupa ~80px. Lo solucionamos con `bottom: 100` en el padding del `ListView`.\n\n### 🗑️ Icono de IA Redundante\n\nEliminamos el botón de AI Coach (ícono de `psychology`) del header de la pantalla principal en móvil. Ahora que el AI Coach tiene su propio tab en la navegación inferior, tener el ícono doble era confuso.\n\n---\n\n### 🖥️ Sidebar Web Persistente\n\nTeníamos un problema en la versión web: al hacer clic en \"AI Chat\" o \"Plan Semanal\" desde el sidebar izquierdo, la app navegaba con `context.push('/ai-coach?tab=N')`, lo cual **reemplazaba toda la vista** y el sidebar desaparecía.\n\n**La solución fue embeber las vistas de IA dentro del `IndexedStack`** del layout web:\n- Agregamos `EmbeddedAiChatPage` (índice 3) y `WeeklyPlansListView` (índice 4) como hijos del `IndexedStack`.\n- Cambiamos los items del sidebar para usar `onNavTap(index)` en vez de `context.push()`.\n- Añadimos estado de selección visual (fondo verde sutil + borde) para los items de IA cuando están activos.\n\nAhora el sidebar **siempre permanece visible**, sin importar qué sección esté viendo el usuario.\n\n---\n\n### 📊 Rediseño Completo de la Tabla del Plan Semanal\n\nLa tabla del plan semanal se renderizaba como markdown plano — funcional pero visualmente pobre. Hicimos un rediseño completo:\n\n#### Parser de Secciones\nCreamos un parser que divide el contenido markdown en secciones (`## Resumen`, `### Plan Semanal`, `### Foco`, `### Meta`). Cada sección recibe un ícono y color únicos:\n- 📊 **Resumen** → azul, `bar_chart`\n- 📅 **Plan Semanal** → verde, `table_chart`\n- 🎯 **Foco** → amarillo, `gps_fixed`\n- 🏆 **Meta** → naranja, `emoji_events`\n\n#### Tabla Custom (`WeeklyPlanTable`)\nCreamos un widget dedicado que reemplaza la tabla markdown plana:\n- **Header con gradiente verde** (primary → primaryDark)\n- **Zebra striping** en las filas de datos (alternando fondo)\n- **Columna \"Total\" resaltada** con tinte verde sutil\n- **Fila de totales** separada con borde superior y texto bold\n- **Bordes redondeados** con `clipBehavior: Clip.antiAlias`\n\n#### Fix: Asteriscos Visibles\nAl renderizar la tabla, los marcadores de negrita de markdown (`**Lun**`, `**Total semanal:**`) se mostraban como texto literal. Agregamos `.replaceAll('**', '')` al parsear las celdas para limpiar los marcadores.\n\n#### Fix: Fila Total Duplicada\nLa fila de totales se renderizaba dos veces: una con `_buildDataRow` y otra con `_buildTotalRow`. Cambiamos el generador para usar `_dataRows.length` (que excluye la fila total) en vez de `data.rows.length`.\n\n---\n\n### 🟢 Status del AI Coach en la Web\n\nAgregamos visibilidad del estado de conexión con Claude en dos lugares:\n\n#### Header Web\nUn chip en la barra superior que muestra:\n- 🟢 **\"AI Coach: Conectado\"** con punto verde cuando Claude está vinculado\n- 🟡 **\"AI Coach: Sin conectar\"** con punto amarillo cuando no hay conexión\n- Al hacer clic, abre el modal de conexión/desconexión de Claude\n\n#### Perfil Web\nUna tarjeta nueva (`_AiCoachCard`) entre las estadísticas rápidas y la zona de peligro:\n- Muestra el estado con indicador de color y texto descriptivo\n- Borde verde o amarillo según el estado\n- Botón \"Conectar Claude\" (filled, verde) o \"Gestionar conexión\" (outlined, gris)\n- Al hacer clic abre el `ClaudeConnectSheet` y refresca el estado al cerrar\n\nAmbos componentes son `StatefulWidget` que consultan `ClaudeOAuthRemoteDatasource.getStatus()` en `initState` y se actualizan después de cualquier cambio.\n\n---\n\n### 💡 Detalle técnico: Parser de Markdown → Secciones\n\n```dart\nList<_Section> _parseSections(String content) {\n  final lines = content.split('\\n');\n  for (final line in lines) {\n    if (line.startsWith('## ') || line.startsWith('### ')) {\n      flushSection();\n      currentTitle = line.replaceFirst(RegExp(r'^#{2,3}\\s*'), '');\n    } else if (line.contains('|') && currentTitle.isNotEmpty) {\n      if (RegExp(r'^[\\|\\s\\-:]+$').hasMatch(line.trim())) continue;\n      final cells = line.split('|')\n          .map((c) => c.trim().replaceAll('**', ''))\n          .where((c) => c.isNotEmpty).toList();\n      // Build TableData from cells...\n    } else {\n      buffer.writeln(line);\n    }\n  }\n}\n```\n\nEste parser convierte markdown crudo en widgets tipados: las tablas se renderizan con `WeeklyPlanTable` y el texto libre con `MarkdownBody` dentro de contenedores estilizados.\n\n---\n\n**Estado:** La versión web ya se siente completa — sidebar persistente, tablas con diseño profesional, y el estado del AI Coach visible en todo momento. La experiencia es consistente entre móvil y web. 🎯"
    }
  ]
}
