{
  "postId": "10k-hours-tracker",
  "entries": [
    {
      "id": 1,
      "timestamp": "2026-02-04T00:00:00Z",
      "title": "Idea: Aplicaci칩n 10K Hours Tracker",
      "text": "Se me ocurri칩 crear una aplicaci칩n para trackear las horas que dedico a diferentes temas o habilidades. La inspiraci칩n viene de la Teor칤a de las 10,000 horas de Malcolm Gladwell, que propone que se necesitan aproximadamente 10,000 horas de pr치ctica deliberada para alcanzar el nivel de experto en cualquier disciplina.\n\nConcepto de la interfaz: La visualizaci칩n estar칤a inspirada en el contribution graph de GitHub (ese calendario con cuadros verdes que muestra la actividad de commits). Quiero que el usuario pueda ver su progreso de forma visual y clara, similar a c칩mo GitHub representa la actividad diaria.\n\nFuncionalidad principal: El usuario podr치 registrar su progreso d칤a a d칤a. Por ejemplo: 'Hoy practiqu칠 3 horas de piano' se registra, y la app ir치 acumulando y visualizando todo el historial de pr치ctica, mostrando el avance hacia la meta de las 10,000 horas.\n\nPr칩ximos pasos: Tengo planeada una integraci칩n adicional con IA, pero eso lo detallar칠 en la siguiente nota."
    },
    {
      "id": 2,
      "timestamp": "2026-02-04T01:00:00Z",
      "title": "Stack T칠cnico y Primeros Pasos",
      "text": "Durante estas sesiones ir칠 documentando todo el progreso del desarrollo. Ser치 una app Android por el momento, ya que es m치s sencillo desplegarla.\n\nMetodolog칤a: El desarrollo ser치 principalmente mediante vibe coding - yo genero las instrucciones y Claude Sonnet 4.5 se encarga de escribir todo el c칩digo, la base de datos, y los requerimientos t칠cnicos/funcionales. El objetivo es no escribir absolutamente una sola l칤nea de c칩digo manualmente.\n\nStack tecnol칩gico: Runtime Bun (extremadamente r치pido), Backend con Hono (framework web), Base de datos PostgreSQL, y ORM Prisma.\n\nEsquema de base de datos actual: Claude Code ya gener칩 un esquema inicial bastante bueno con tres tablas principales: User (tabla de usuarios), Skills (los temas o habilidades que queremos trackear, ej: piano, programaci칩n), y Sessions (las horas registradas, relacionadas a cada skill).\n\nEstado actual: Estoy trabajando en los endpoints de registro de usuario. Ya tengo los requerimientos t칠cnicos definidos y voy a crear pruebas automatizadas para validar el flujo de registro."
    },
    {
      "id": 3,
      "timestamp": "2026-02-04T02:00:00Z",
      "title": "Dise침o UI, Flutter y Arquitectura Limpia",
      "text": "He estado revisando algunos temas y paletas de color para ver c칩mo pudiera hacer la aplicaci칩n. Estoy pensando seriamente en un verde, pero no lo s칠, como con verdes un poco raro pero probablemente s칤, dependiendo de c칩mo se vea. Por ah칤 voy a decirle a Claude que me genere un tema para Flutter.\n\nYo la neta no s칠 nada de Flutter, literal no s칠 nada de Flutter. Entonces 쯖칩mo le voy a hacer para saber si voy por el lugar correcto, que est치 escribiendo las instrucciones correctas? Pues por ah칤 utilic칠 instrucciones bien definidas que investigu칠, o que la misma gente tambi칠n investig칩 y que sabe c칩mo tener una buena arquitectura y una buena estructura en Flutter.\n\nQuiero evitar que se creen archivos muy gigantes porque me ha pasado en el pasado que el LLM como que en Flutter crea archivos demasiado grandes. Y pues queremos evitar eso porque para la ventana del contexto de un LLM es mucho m치s complicado leer un archivo que es muy grande - es m치s sencillo que el LLM lea archivos peque침os y tenga como que mayor contexto del problema al que se va a enfrentar.\n\nProgreso actual: Parece que ya puedo registrarme, voy a hacer el login. Por ah칤 lanc칠 unas pruebas de integraci칩n tambi칠n totalmente automatizadas. Ahora mismo estoy viendo la interfaz de usuario, cu치l ser치 el mejor dise침o. Estoy viendo algunos buenos dise침os y los voy a pasar al modelo para que analice las im치genes y a partir de ah칤 ya me genere pues algo bello. 춰Vamos a ver qu칠 onda raza!"
    },
    {
      "id": 4,
      "timestamp": "2026-02-04T08:45:10Z",
      "title": "Login, Backend y Perfil de Usuario",
      "text": "Al final, si optamos por usar el tema verde, entonces as칤 vamos a dise침ar la aplicaci칩n con ese tema verde-cinch. Ya logramos crear el login conectado con el backend. Lanc칠 unas pruebas y todo pas칩 correctamente. Tambi칠n logramos conectar Nodemailer para mandar correos de verificaci칩n en el login, con un c칩digo de verificaci칩n que el usuario debe ingresar cuando se registra.\n\nVi un dise침o de navegador, un tabulador (App Tab) en Google que me gust칩 mucho. El modelo lo replic칩 muy bien; se ve excelente.\n\nLogr칠 crear la secci칩n de perfil donde se muestran los datos del usuario: correo, nombre, la opci칩n para cambiar contrase침a y un bot칩n para cerrar sesi칩n. Sin embargo, el bot칩n para cerrar sesi칩n no est치 funcionando correctamente; devuelve una excepci칩n. Voy a investigar por qu칠 ocurre esto.\n\nHasta aqu칤 mi reporte.",
      "image": "post/entry-4-app-tab.png",
      "imageCaption": "Dise침o del App Tab replicado por el modelo"
    },
    {
      "id": 5,
      "timestamp": "2026-02-05T02:14:37Z",
      "title": "M칩dulo de Skills, Cron칩metro y Rachas",
      "text": "## Resumen del avance del 4 de febrero de 2026\n\nHoy implementamos el m칩dulo completo de **Skills** con las siguientes funcionalidades:\n\n### CRUD de Skills\n- **Crear** un nuevo skill para dar seguimiento a las 10,000 horas\n- **Editar** skill: cambiar t칤tulo, emoji y color de la interfaz\n- **Eliminar** skills\n\n### Cron칩metro de Pr치ctica\nImplementamos un cron칩metro que cuenta las horas de pr치ctica en tiempo real:\n- En la interfaz se visualiza el tiempo transcurrido\n- En la app m칩vil funciona en background con notificaciones mostrando el progreso\n- Al detener el cron칩metro se genera autom치ticamente una nueva entrada de sesi칩n\n\n### Sesiones Manuales\nTambi칠n se puede crear una sesi칩n de forma manual con:\n- T칤tulo personalizado\n- Comentarios sobre la pr치ctica\n- Fecha espec칤fica\n\n*Aunque el cron칩metro es m치s intuitivo y conveniente.*\n\n### Sistema de Rachas (Streaks)\nAgregamos la funcionalidad de rachas en el header:\n- Muestra el n칰mero de d칤as consecutivos de pr치ctica\n- Sirve como incentivo y motivaci칩n para no perder la racha\n\n### Visualizador tipo GitHub\nImplementamos un visualizador de actividad estilo GitHub (contribution graph). Por el momento funciona bien, pero se puede mejorar en futuras iteraciones.\n\n---\n\n**Estado:** Las funcionalidades principales est치n completas. Quedan algunos ajustes de UI por pulir.",
      "image": "post/entry-5-skills-module.png",
      "imageCaption": "M칩dulo de Skills con cron칩metro y visualizador de actividad"
    },
    {
      "id": 6,
      "timestamp": "2026-02-05T08:45:04Z",
      "title": "Temporizador Minimalista y M칩dulo de Resumen",
      "text": "## Avances del 5 de febrero de 2026\n\nHoy trabajamos en varias mejoras importantes para la experiencia de usuario.\n\n### Temporizador Redise침ado\nEl temporizador ahora es **m치s minimalista** porque la versi칩n anterior ocupaba demasiado espacio en pantalla:\n- Corre en **background** cuando cierras la aplicaci칩n\n- Muestra el progreso en las **notificaciones** del sistema\n- Al dar clic en la notificaci칩n, abre la app autom치ticamente\n\n### Nueva Navegaci칩n (Tab Nav)\nRedise침amos el navegador inferior con tres secciones:\n- 游 **Home** - Casita como pantalla principal\n- 仇벒잺 **Resumen General** - Nuevo m칩dulo central\n- 游녻 **Perfil** - Configuraci칩n del usuario\n\n### M칩dulo de Resumen General\nEste nuevo m칩dulo muestra estad칤sticas consolidadas:\n- **Total de horas** acumuladas en todos los skills\n- **N칰mero de skills** que est치s trackeando\n- **Media promedio** de horas por skill\n- 游늵 **Gr치fica de horas por mes** - Visualizaci칩n del progreso mensual vs mes anterior\n\n### Fecha Estimada de Meta\nAgregamos una caracter칤stica muy 칰til:\n- Calcula **cu치ndo alcanzar치s las 10,000 horas** bas치ndose en tu historial\n- Te dice si faltan 10, 20, 140 d칤as... seg칰n tu ritmo actual\n\n### Rachas por Skill\nAhora puedes ver la **racha individual** de cada skill en una lista dedicada.\n\n---\n\n**Pr칩ximo paso:** Estoy trabajando en un **onboarding para nuevos usuarios** que explicar치 en qu칠 consiste la app, guiar치 la creaci칩n del primer skill y dar치 una vista general de las funcionalidades.",
      "image": "post/entry-6-summary-module.png",
      "imageCaption": "Nuevo m칩dulo de resumen general con estad칤sticas"
    }
  ]
}
